app/views/videos/index.html.erb

SELECT "videos".* FROM "videos"
---

    $(document).ready(function () {
        lc({'tag':'Football'}).isReady(function () {
            var listLength = lc(this).length;
            var listOfWidgets = lc(this);
            var videoDiv = document.getElementById('video');

            for (var i = 0; i < listLength; i++) {
                try {
                    var videoListDiv = document.createElement("div");
                    videoListDiv.className = "columns five";
                    videoListDiv.id = "video-list" + i;

                    var thumbnailDiv = document.createElement("div");
                    thumbnailDiv.className = "video-list-box";

                    var imageDiv = document.createElement("div");
                    imageDiv.className = "image-container";

                    var descriptionOverlay = document.createElement("p");
                    descriptionOverlay.className = "description";
                    descriptionOverlay.textContent = lc(this).getByIndex(i).title;