footballflick/app/controllers/videos_controller.rb

  def show
    @videos = Video.all
---
SELECT "videos".* FROM "videos"