app/controllers/videos_controller.rb

  def show
    @videos=Video.find(params[:id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]